
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3120464824)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/967e2999-67d7-4344-aef6-6e270655c434/terraform-bin apply -auto-approve -input=false
data.http.ghactions_oidc_config: Reading...
data.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
data.tls_certificate.ghactions: Reading...
data.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
aws_iam_user.memo_board: Refreshing state... [id=memo-board]
data.aws_iam_policy_document.memo_board_tf1: Reading...
aws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=4121294339]
aws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]
data.aws_iam_policy_document.memo_board_cd: Reading...
data.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]
data.aws_iam_policy_document.memo_board_tf: Reading...
data.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]
aws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]
aws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]
aws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.memo_board_cd1 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "memo_board_cd1" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowPushPull"
        }
    }

  # aws_ecr_repository.memo-board-rs will be created
  + resource "aws_ecr_repository" "memo-board-rs" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "memo-board-rs"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_iam_policy.memo_board_cd1 will be created
  + resource "aws_iam_policy" "memo_board_cd1" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "memo_board_cd1"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.memo_board_cd will be created
  + resource "aws_iam_role" "memo_board_cd" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + "ForAnyValue:StringEquals" = {
                              + "token.actions.githubusercontent.com:sub" = "repo:hiyoko3m/memo-board:ref:refs/heads/main"
                            }
                          + StringEquals               = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "memo-board-cd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.memo_board_cd1 will be created
  + resource "aws_iam_role_policy_attachment" "memo_board_cd1" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "memo-board-cd"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_ecr_repository.memo-board-rs: Creating...
aws_iam_role.memo_board_cd: Creating...
aws_iam_role.memo_board_cd: Creation complete after 1s [id=memo-board-cd]
aws_ecr_repository.memo-board-rs: Creation complete after 1s [id=memo-board-rs]
data.aws_iam_policy_document.memo_board_cd1: Reading...
data.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=1879182784]
aws_iam_policy.memo_board_cd1: Creating...
aws_iam_policy.memo_board_cd1: Creation complete after 1s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_iam_role_policy_attachment.memo_board_cd1: Creating...
aws_iam_role_policy_attachment.memo_board_cd1: Creation complete after 0s [id=memo-board-cd-20220925012718679900000001]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=4121294339]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_iam_policy_document.memo_board_cd1 will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "memo_board_cd1" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "ecr:BatchCheckLayerAvailability",%0A              + "ecr:BatchGetImage",%0A              + "ecr:CompleteLayerUpload",%0A              + "ecr:GetDownloadUrlForLayer",%0A              + "ecr:InitiateLayerUpload",%0A              + "ecr:PutImage",%0A              + "ecr:UploadLayerPart",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AllowPushPull"%0A        }%0A    }%0A%0A  # aws_ecr_repository.memo-board-rs will be created%0A  + resource "aws_ecr_repository" "memo-board-rs" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "memo-board-rs"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A    }%0A%0A  # aws_iam_policy.memo_board_cd1 will be created%0A  + resource "aws_iam_policy" "memo_board_cd1" {%0A      + arn       = (known after apply)%0A      + id        = (known after apply)%0A      + name      = "memo_board_cd1"%0A      + path      = "/"%0A      + policy    = (known after apply)%0A      + policy_id = (known after apply)%0A      + tags_all  = (known after apply)%0A    }%0A%0A  # aws_iam_role.memo_board_cd will be created%0A  + resource "aws_iam_role" "memo_board_cd" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + "ForAnyValue:StringEquals" = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:hiyoko3m/memo-board:ref:refs/heads/main"%0A                            }%0A                          + StringEquals               = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                      + Sid       = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "memo-board-cd"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # aws_iam_role_policy_attachment.memo_board_cd1 will be created%0A  + resource "aws_iam_role_policy_attachment" "memo_board_cd1" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "memo-board-cd"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0Aaws_ecr_repository.memo-board-rs: Creating...%0Aaws_iam_role.memo_board_cd: Creating...%0Aaws_iam_role.memo_board_cd: Creation complete after 1s [id=memo-board-cd]%0Aaws_ecr_repository.memo-board-rs: Creation complete after 1s [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=1879182784]%0Aaws_iam_policy.memo_board_cd1: Creating...%0Aaws_iam_policy.memo_board_cd1: Creation complete after 1s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Creating...%0Aaws_iam_role_policy_attachment.memo_board_cd1: Creation complete after 0s [id=memo-board-cd-20220925012718679900000001]%0A%0AApply complete! Resources: 4 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=4121294339]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_iam_policy_document.memo_board_cd1 will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "memo_board_cd1" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "ecr:BatchCheckLayerAvailability",%0A              + "ecr:BatchGetImage",%0A              + "ecr:CompleteLayerUpload",%0A              + "ecr:GetDownloadUrlForLayer",%0A              + "ecr:InitiateLayerUpload",%0A              + "ecr:PutImage",%0A              + "ecr:UploadLayerPart",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AllowPushPull"%0A        }%0A    }%0A%0A  # aws_ecr_repository.memo-board-rs will be created%0A  + resource "aws_ecr_repository" "memo-board-rs" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "memo-board-rs"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A    }%0A%0A  # aws_iam_policy.memo_board_cd1 will be created%0A  + resource "aws_iam_policy" "memo_board_cd1" {%0A      + arn       = (known after apply)%0A      + id        = (known after apply)%0A      + name      = "memo_board_cd1"%0A      + path      = "/"%0A      + policy    = (known after apply)%0A      + policy_id = (known after apply)%0A      + tags_all  = (known after apply)%0A    }%0A%0A  # aws_iam_role.memo_board_cd will be created%0A  + resource "aws_iam_role" "memo_board_cd" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + "ForAnyValue:StringEquals" = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:hiyoko3m/memo-board:ref:refs/heads/main"%0A                            }%0A                          + StringEquals               = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                      + Sid       = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "memo-board-cd"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # aws_iam_role_policy_attachment.memo_board_cd1 will be created%0A  + resource "aws_iam_role_policy_attachment" "memo_board_cd1" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "memo-board-cd"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0Aaws_ecr_repository.memo-board-rs: Creating...%0Aaws_iam_role.memo_board_cd: Creating...%0Aaws_iam_role.memo_board_cd: Creation complete after 1s [id=memo-board-cd]%0Aaws_ecr_repository.memo-board-rs: Creation complete after 1s [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=1879182784]%0Aaws_iam_policy.memo_board_cd1: Creating...%0Aaws_iam_policy.memo_board_cd1: Creation complete after 1s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Creating...%0Aaws_iam_role_policy_attachment.memo_board_cd1: Creation complete after 0s [id=memo-board-cd-20220925012718679900000001]%0A%0AApply complete! Resources: 4 added, 0 changed, 0 destroyed.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"4b938495eb4a6ed408a5b4a5ba8c8f61ded06400","Vars":{},"WorkflowName":"Terraform"} -->